#include <stdio.h>  

int main ( ) {  
    int n ;  
    printf ( "Enter number: " ) ;     // ขอให้ผู้ใช้ป้อนค่า  
    scanf ( "%d" , &n ) ;              // รับค่าจากผู้ใช้เก็บในตัวแปร n  
    // วนลูปจาก n ลงมาถึง 2  
    for ( int i = n ; i >= 2 ; i-- ) {  
        int x = 1 ;                    //  i เป็นจำนวนเฉพาะ  
        // เช็คตัวหารไปเรื่อย ๆ ตั้งแต่ 2 ขึ้นไป จนถึง i-1 เท่านั้น
        for ( int j = 2 ; j <= i / j ; j++ ) {  
            if ( i % j == 0 )          // ถ้าหารลงตัว  
            {  
                x = 0 ;                // i ไม่ใช่จำนวนเฉพาะ 
                break ;                // หยุดตรวจสอบ  
            }  
        }  
        if ( x )                 // ถ้าเป็นจำนวนเฉพาะ  
        {  
            printf ( "%d " , i ) ;     // แสดงผล  
        }  
    } //end for

    return 0 ;  
} //end function
