#include <stdio.h>  

int main() {                      // ฟังก์ชันหลัก
    int N ;                       // ตัวแปรเก็บจำนวนสมาชิกของอาเรย์

    printf( "Enter N :\n" ) ;    // แสดงข้อความให้ผู้ใช้กรอก N
    scanf( "%d" , &N ) ;         // รับค่าจำนวนสมาชิกของอาเรย์

    int arr[ N ] ;                              // ประกาศอาเรย์ตามจำนวนที่ผู้ใช้กรอก

    for ( int i = 0 ; i < N ; i++ ) {           // ลูปใส่ค่าลงอาเรย์
        printf( "Enter value[ %d ] :\n" , i ) ; // แสดงตำแหน่งที่จะใส่ค่า
        scanf( "%d" , &arr[ i ] ) ;             // รับค่าที่ผู้ใช้กรอกเก็บใน arr[i]
    }

    printf( "Index: " ) ;                       // แสดงหัวข้อ Index
    for ( int i = 0 ; i < N ; i++ ) {           // ลูปแสดงตำแหน่ง index
        printf( "%2d " , i ) ;                  // พิมพ์ตำแหน่ง index
    }
    printf( "\n" ) ;                           // เว้นบรรทัด

    printf( "Array: " ) ;                      // แสดงหัวข้อ Array
    for ( int i = 0 ; i < N ; i++ ) {          // ลูปตรวจสอบค่าในอาเรย์
        int n = arr[ i ] ;                     // เก็บค่าของสมาชิก arr[i] ไว้ที่ n
        int prime = 1 ;                        // สมมติว่าเป็นจำนวนเฉพาะ (ค่าเริ่มต้น = จริง)

        if ( n < 2 ) {                          // ถ้าตัวเลขน้อยกว่า 2
            prime = 0 ;                         // ไม่ใช่จำนวนเฉพาะ
        } else {
            for ( int j = 2 ; j < n ; j++ ) {   // ตรวจสอบว่าหารลงตัวหรือไม่
                if ( n % j == 0 ) {             // ถ้าหารลงตัว
                    prime = 0 ;                  // ไม่ใช่จำนวนเฉพาะ
                    break ;                      // หยุดการตรวจสอบ
                }
            }
        }

        if ( prime == 1 )            // ถ้าเป็นจำนวนเฉพาะ
            printf( "%2d " , n ) ;   // แสดงตัวเลขจริง
        else
            printf( " # " ) ;       // ถ้าไม่ใช่ แสดงเครื่องหมาย #
    }
    printf( "\n" ) ;                // เว้นบรรทัดตอนจบ

    return 0 ;                       // จบโปรแกรม
}
